# Taps
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "neovim/neovim"
tap "FelixKratz/formulae"
tap "koekeishiya/formulae"
tap "noahgorstein/tap"
tap "cantino/mcfly"

# Desktop tools
cask "1password"
cask "kitty"
cask "gimp"
brew "yabai"
cask "protonmail-bridge"
cask "balenaetcher"
cask "iina"
cask "steam"

# Communication & entertainment
cask "slack"
cask "whatsapp"
cask "spotify"

# CLI tools
brew "macvim"
brew "wget"
brew "jq"
brew "fd"
brew "kubeseal"
brew "luarocks"
brew "ripgrep"
brew "speedtest-cli"
brew "lsd"
brew "neofetch"
brew "bat"
brew "eth-p/software/bat-extras"
brew "skhd", restart_service: true
brew "pass"
brew "w3m"
brew "gotop"
brew "gping"
brew "wego"
brew "mas"
brew "autojump"
brew "fish"
brew "tree"
brew "watch"
brew "llvm"
brew "jqp"
brew "fisher"
brew "chezmoi"
brew "luajit"
brew "mcfly"
brew "midnight-commander"
brew "wallpaper"

# Productivity
brew "k9s"
brew "azure-cli"
brew "lazygit"
brew "lazydocker"
brew "helm"
brew "git"
cask "obsidian"
cask "alt-tab"
cask "monitorcontrol"
cask "numi"
cask "appcleaner"
cask "raycast"
cask "shottr"
cask "hiddenbar"
cask "latest"

# Code development
brew "neovim"
brew "maven"
cask "docker"
brew "docker-compose"
brew "perl"
cask "dotnet-sdk"
cask "ngrok"
cask "minikube"

# Fonts
cask "font-jetbrains-mono"

# Build tools
brew "python@3.9"
brew "python@3.10"
brew "cmake"
brew "ctags"
brew "go"
brew "openssl@3", link: true
brew "pkg-config"
brew "yarn"

# Mas
mas "Bitwarden", id: 1352778147
mas "Xcode", id: 497799835
mas "System Color Picker", id: 1545870783
mas "Meeter", id: 1510445899
