# Taps
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "neovim/neovim"
tap "FelixKratz/formulae"
tap "koekeishiya/formulae"

# Desktop tools
cask "1password"
cask "firefox"
cask "kitty"
cask "spotify"
cask "gimp"
brew "sketchybar"
brew "yabai"
cask "protonmail-bridge"

# Communication
cask "discord"
cask "slack"
cask "whatsapp"
brew "weechat"
brew "msmtp"
brew "neomutt"
brew "khal"
brew "vdirsyncer"

# CLI app
brew "spotify-tui"
brew "lazygit"
brew "neovim", args: ["HEAD"]

# CLI tools
brew "macvim"
brew "wget"
cask "docker"
brew "docker-compose"
brew "node"
brew "angular-cli"
brew "azure-cli"
brew "jq"
brew "fd"
brew "kubeseal"
brew "luarocks"
brew "maven"
brew "ripgrep"
brew "speedtest-cli"
brew "lsd"
brew "neofetch"
brew "bat"
brew "notmuch"
brew "pandoc"
brew "skhd"
brew "k9s"
brew "pass"
brew "w3m"
brew "bpytop"
brew "ddgr"
brew "ranger"

# Terminal stuff
brew "fish"
brew "tree"
brew "watch"

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"

# Formatters
brew "eslint"
brew "astyle"
brew "semgrep"
brew "stylua"

# Build tools
brew "python@3.9"
brew "cmake"
brew "ctags"
brew "go"
brew "openjdk@17"
brew "openssl@3", link: true
brew "pkg-config"
brew "yarn"
