# Taps
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "neovim/neovim"
tap "FelixKratz/formulae"
tap "koekeishiya/formulae"

# Desktop tools
cask "1password"
cask "firefox"
cask "kitty"
cask "gimp"
brew "sketchybar", restart_service: true
brew "yabai"
cask "protonmail-bridge"
cask "balenaetcher"

# Communication
cask "discord"
cask "slack"
cask "whatsapp"
brew "weechat"
brew "msmtp"
brew "neomutt"
brew "khal"

# CLI tools
brew "macvim"
brew "spotify-tui"
brew "wget"
brew "jq"
brew "fd"
brew "kubeseal"
brew "luarocks"
brew "ripgrep"
brew "speedtest-cli"
brew "lsd"
brew "neofetch"
brew "bat"
brew "eth-p/software/bat-extras"
brew "notmuch"
brew "pandoc"
brew "skhd", restart_service: true
brew "pass"
brew "w3m"
brew "gotop"
brew "ranger"
brew "gping"
brew "wego"
brew "mas"
brew "thefuck"
brew "autojump"
brew "fish"
brew "tree"
brew "watch"
brew "llvm"

# Productivity
brew "k9s"
brew "azure-cli"
brew "lazygit"
brew "lazydocker"
brew "helm"
brew "git"
brew "isync", restart_service: true
brew "vdirsyncer", restart_service: true
brew "spotifyd", restart_service: true

# Code development
brew "neovim", args: ["HEAD"]
brew "maven"
cask "docker"
brew "docker-compose"
brew "node"
cask "android-studio"
cask "android-commandlinetools"
brew "perl"
brew "angular-cli"
cask "dotnet-sdk"

# eonts
cask "font-hack-nerd-font"

# Formatters
brew "eslint"
brew "astyle"
brew "semgrep"
brew "stylua"
brew "uncrustify"
brew "hadolint"

# Build tools
brew "python@3.9"
brew "python@3.10"
brew "cmake"
brew "ctags"
brew "go"
brew "openjdk@17"
brew "openssl@3", link: true
brew "pkg-config"
brew "yarn"

# Mas
mas "Bitwarden", id: 1352778147
mas "Xcode", id: 497799835
mas "System Color Picker", id: 1545870783
