{
  "$schema": "https://aka.ms/winget-packages.schema.2.0.json",
  "CreationDate": "2024-07-27T19:53:02.310-00:00",
  "Sources": [
    {
      "Packages": [
        {
          "PackageIdentifier": "ajeetdsouza.zoxide"
        },
        {
          "PackageIdentifier": "7zip.7zip"
        },
        {
          "PackageIdentifier": "Docker.DockerDesktop"
        },
        {
          "PackageIdentifier": "Git.Git"
        },
        {
          "PackageIdentifier": "Mozilla.Firefox"
        },
        {
          "PackageIdentifier": "Neovim.Neovim"
        },
        {
          "PackageIdentifier": "Microsoft.PowerShell.Preview"
        },
        {
          "PackageIdentifier": "Valve.Steam"
        },
        {
          "PackageIdentifier": "DEVCOM.JetBrainsMonoNerdFont"
        },
        {
          "PackageIdentifier": "JesseDuffield.Lazydocker"
        },
        {
          "PackageIdentifier": "JesseDuffield.lazygit"
        },
        {
          "PackageIdentifier": "JanDeDobbeleer.OhMyPosh"
        },
        {
          "PackageIdentifier": "junegunn.fzf"
        },
        {
          "PackageIdentifier": "lsd-rs.lsd"
        },
        {
          "PackageIdentifier": "sharkdp.bat"
        },
        {
          "PackageIdentifier": "sharkdp.fd"
        },
        {
          "PackageIdentifier": "Microsoft.WindowsTerminal.Preview"
        }
      ],
      "SourceDetails": {
        "Argument": "https://cdn.winget.microsoft.com/cache",
        "Identifier": "Microsoft.Winget.Source_8wekyb3d8bbwe",
        "Name": "winget",
        "Type": "Microsoft.PreIndexed.Package"
      }
    }
  ],
  "WinGetVersion": "1.8.1911"
}
